namespace Task6_3
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Нужно создать отчёт, который будет содержать информацию о продажах за определённый период.
            //Отчёт должен быть отформатирован следующим образом:

            // Название отчёта: "Отчёт о продажах за [месяц] [год]".
            // Информация о продажах:
            // Общая сумма продаж.
            // Количество проданных товаров.
            // Средняя стоимость одного товара.

            //Общая сумма продаж должна быть отформатирована как денежная величина(с разделителями тысяч и двумя знаками после запятой).
            //Средняя стоимость товара должна быть отформатирована с двумя знаками после запятой.

            // Пример данных:
            // Месяц: "Март"
            // Год: 2025
            // Общая сумма продаж: 1234567.89
            // Количество проданных товаров: 1234

            //Пример отчёта:
            //--------------------------------

            //Отчёт о продажах за Март 2025
            //--------------------------------

            //Общая сумма продаж: 1 234 567,89 р.

            //Количество проданных товаров: 1 234 шт.

            //Средняя стоимость товара: 1 000,46 р.
            //--------------------------------




            Console.WriteLine("Hello, World!");
        }
    }
}
